SecondTask/app/views/cards/show.json.jbuilder

SELECT "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  json.description @card.description
  json.column @column.title