SecondTask/app/controllers/cards_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1  [["column_id", 6]]
---
  def index
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:column_id])
    @cards = @column.cards.all

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["column_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
---
  def show
    @card = Card.find(params[:id])
    @column = Column.find(@card.column_id)
    @user = User.find(@column.user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "cards" ("title", "description", "column_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test_card"], ["description", "test card"], ["column_id", 1], ["created_at", "2021-11-10 17:49:47.890761"], ["updated_at", "2021-11-10 17:49:47.890761"]]
---
  def create
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:column_id])
    @card = @column.cards.create(card_params)

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cards" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["title", "test_card_test"], ["description", "test card test"], ["updated_at", "2021-11-10 18:01:42.369233"], ["id", 1]]
---
  def update
    @card = Card.find(params[:id])
    @column = Column.find(@card.column_id)
    @user = User.find(@column.user_id)

    if @card.update(card_params)