SecondTask/app/controllers/columns_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @columns = @user.columns.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "columns" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test_column"], ["description", "test column"], ["user_id", 1], ["created_at", "2021-11-10 17:49:07.434584"], ["updated_at", "2021-11-10 17:49:07.434584"]]
---
  def create
    @user = User.find(params[:user_id])
    @column = @user.columns.create(column_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "columns" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "columns"."id" = $4  [["title", "test_column123"], ["description", "testing column123"], ["updated_at", "2021-11-10 05:03:17.372819"], ["id", 6]]
---
  def update
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:id])
    if @column.update(column_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "columns" WHERE "columns"."id" = $1  [["id", 1]]
---
  def destroy
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:id])
    if @column.destroy