SecondTask/app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["column_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."card_id" = $1  [["card_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:column_id])
    @card = @column.cards.find(params[:card_id])
    @comments = @card.comments.all

SELECT "comments".* FROM "comments" WHERE "comments"."card_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["card_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["column_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find(params[:id])
    @card = Card.find(@comment.card_id)
    @column = Column.find(@card.column_id)
    @user = User.find(@column.user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["column_id", 6], ["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Kirill"], ["body", "simple text"], ["card_id", 1], ["created_at", "2021-11-10 05:17:56.142932"], ["updated_at", "2021-11-10 05:17:56.142932"]]
---
  def create
    @user = User.find(params[:user_id])
    @column = @user.columns.find(params[:column_id])
    @card = @column.cards.find(params[:card_id])
    @comment = @card.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."card_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["card_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["column_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."user_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "comments" SET "commenter" = $1, "body" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["commenter", "Nikita"], ["body", "simple text1"], ["updated_at", "2021-11-10 05:20:28.615121"], ["id", 1]]
---
  def update
    @comment = Comment.find(params[:id])
    @card = Card.find(@comment.card_id)
    @column = Column.find(@card.column_id)
    @user = User.find(@column.user_id)

    if @comment.update(comment_params)