SecondTask/app/views/columns/show.json.jbuilder

json.column do
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]